[
    {
        "UserName": "Lisa",
        "Gender": "female",
        "DateOfBirth": "1999-07-22",
        "KnownAs": "Lisa",
        "Created": "2020-06-24",
        "LastActive": "2020-06-21",
        "Introduction": "Hey there! I'm Lisa, a fun-loving and adventurous woman who loves to try new things and explore new places. I have a great sense of humor and love to make people laugh.\r\n",
        "LookingFor": "I'm looking for someone who is kind, genuine, and has a great sense of humor. Someone who is adventurous and open to trying new things.\r\n",
        "Interests": "I enjoy hiking, yoga, reading, trying new restaurants, and traveling. I'm always looking for my next adventure and love exploring new places.",
        "City": "Greenbush",
        "Country": "Martinique",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/54.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Kyra",
        "Gender": "female",
        "DateOfBirth": "1995-10-12",
        "KnownAs": "Kyra",
        "Created": "2019-12-09",
        "LastActive": "2020-05-06",
        "Introduction": "Hi there, I'm Kyra. I'm an outgoing and ambitious woman who loves to challenge herself and reach new heights. I'm always up for trying new things and exploring new places.\r\n",
        "LookingFor": "I'm looking for someone who is driven, intelligent, and ambitious. Someone who is passionate about their goals and isn't afraid to take risks.\r\n",
        "Interests": "I love to travel, try new foods, stay active, and learn new things. In my free time, you'll usually find me hiking, reading, or practicing yoga.",
        "City": "Celeryville",
        "Country": "Grenada",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/50.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Margo",
        "Gender": "female",
        "DateOfBirth": "1989-01-24",
        "KnownAs": "Margo",
        "Created": "2019-08-10",
        "LastActive": "2020-05-12",
        "Introduction": "Hello, I'm Margo. I'm a creative and artistic woman who loves to express myself through my work and hobbies. I have a great sense of humor and love to laugh.\r\n",
        "LookingFor": "I'm looking for someone who is kind, intelligent, and shares my passion for the arts. Someone who can appreciate my creativity and supports my artistic pursuits.\r\n",
        "Interests": "I love painting, writing, photography, and exploring new art galleries and museums. In my free time, I enjoy hiking, reading, and spending time with my close friends.",
        "City": "Rosewood",
        "Country": "Svalbard and Jan Mayen Islands",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/14.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Lois",
        "Gender": "female",
        "DateOfBirth": "1995-06-22",
        "KnownAs": "Lois",
        "Created": "2019-04-24",
        "LastActive": "2020-06-17",
        "Introduction": "Hi there, I'm Lois. I'm a warm and compassionate woman who loves to connect with others and help them in any way I can. I have a great sense of humor and love to make people laugh.\r\n",
        "LookingFor": "I'm looking for someone who is kind, caring, and empathetic. Someone who values communication and is willing to put in the effort to make a relationship work.\r\n",
        "Interests": "I enjoy cooking, hiking, practicing yoga, and reading. I also love volunteering and giving back to my community in any way I can.",
        "City": "London",
        "Country": "England",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/11.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Ruthie",
        "Gender": "female",
        "DateOfBirth": "1996-01-12",
        "KnownAs": "Ruthie",
        "Created": "2019-04-30",
        "LastActive": "2020-06-21",
        "Introduction": "Hey, I'm Ruthie. I'm a free-spirited and adventurous woman who loves to explore new places and meet new people. I have a great sense of humor and love to have fun.\r\n",
        "LookingFor": "I'm looking for someone who is spontaneous, adventurous, and loves to have a good time. Someone who can keep up with my energy and enthusiasm.\r\n",
        "Interests": "I love hiking, camping, traveling, and trying new restaurants. In my free time, I enjoy playing guitar, writing, and spending time with my friends.",
        "City": "Germanton",
        "Country": "Antigua and Barbuda",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/women/84.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Todd",
        "Gender": "male",
        "DateOfBirth": "1990-02-07",
        "KnownAs": "Todd",
        "Created": "2019-04-29",
        "LastActive": "2020-05-16",
        "Introduction": "Hey, I'm Todd. I'm a driven and ambitious man who is always looking for ways to improve myself and achieve my goals. I have a great sense of humor and love to make people laugh.\r\n",
        "LookingFor": "I'm looking for someone who is intelligent, ambitious, and shares my drive for success. Someone who can challenge me and push me to be my best self.\r\n",
        "Interests": "I enjoy playing sports, working out, reading, and learning new things. In my free time, you'll usually find me hiking, exploring new neighborhoods, or trying new restaurants.",
        "City": "Cliff",
        "Country": "British Indian Ocean Territory",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/90.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Porter",
        "Gender": "male",
        "DateOfBirth": "1997-04-09",
        "KnownAs": "Porter",
        "Created": "2020-04-05",
        "LastActive": "2020-06-23",
        "Introduction": "Hey there, I'm Porter. I'm a laid-back and easy-going guy who loves to have a good time. I'm looking for someone who can make me laugh and who enjoys living life to the fullest.\r\n",
        "LookingFor": "I'm looking for a woman who is honest and loyal, someone who I can trust and who will always have my back. I'm also attracted to intelligence and a good sense of humor.\r\n",
        "Interests": "I enjoy going out with friends and trying new restaurants and bars. I also love playing video games and watching sports on TV.",
        "City": "Welda",
        "Country": "Christmas Island",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/40.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Mayo",
        "Gender": "male",
        "DateOfBirth": "1990-03-23",
        "KnownAs": "Mayo",
        "Created": "2020-03-14",
        "LastActive": "2020-05-17",
        "Introduction": "Hi, I'm Mayo. I'm a confident and ambitious guy who knows what he wants in life. I'm looking for someone who shares my drive and determination and who can support me in my goals.\r\n",
        "LookingFor": "I'm looking for a woman who is intelligent, independent, and confident in herself. I want someone who can challenge me and who I can learn from.\r\n",
        "Interests": "I enjoy traveling and experiencing new cultures. I also love playing basketball and working out at the gym. In my downtime, I like to read and listen to music.",
        "City": "Clarence",
        "Country": "Burkina Faso",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/57.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Skinner",
        "Gender": "male",
        "DateOfBirth": "1992-12-01",
        "KnownAs": "Skinner",
        "Created": "2019-01-28",
        "LastActive": "2020-06-07",
        "Introduction": "Hey, I'm Skinner. I'm a creative and artistic guy who loves to express myself through music and art. I'm looking for someone who shares my passion for creativity and who can appreciate my unique perspective.\r\n",
        "LookingFor": "I'm looking for a woman who is open-minded and non-judgmental. Someone who is supportive of my creative endeavors and who can inspire me to explore new forms of expression.\r\n",
        "Interests": "I love playing guitar and writing my own music. I also enjoy going to concerts and checking out art galleries. In my free time, I like to read and practice meditation.",
        "City": "Herald",
        "Country": "Poland",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/11.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Davis",
        "Gender": "male",
        "DateOfBirth": "1998-03-20",
        "KnownAs": "Davis",
        "Created": "2020-02-25",
        "LastActive": "2020-06-11",
        "Introduction": "Hi, I'm Davis. I'm a kind and adventurous guy who loves to explore new places and try new things. I'm looking for someone who shares my love for adventure and can keep up with my energy.\r\n",
        "LookingFor": "I'm looking for a confident and independent woman who knows what she wants and isn't afraid to go after it. Someone who can challenge me and push me to be the best version of myself.\r\n",
        "Interests": "I love hiking, camping, and anything else that gets me outside and active. I also enjoy playing sports and watching movies in my downtime.",
        "City": "Lupton",
        "Country": "Luxembourg",
        "Photos": [
            {
                "Url": "https://randomuser.me/api/portraits/men/95.jpg",
                "IsMain": true
            }
        ]
    },
    {
        "UserName": "Theodosis",
        "Gender": "male",
        "DateOfBirth": "1993-10-07",
        "KnownAs": "Theodosis",
        "Created": "2020-02-25",
        "LastActive": "2020-06-11",
        "Introduction": "Hi, I'm Theodosis. I'm the Developer of this App.\r\n",
        "LookingFor": "Some peace.\r\n",
        "Interests": "Committing code-breaking changes.",
        "City": "Thessaloniki",
        "Country": "Greece",
        "Photos": [
            {
                "Url": "https://media.licdn.com/dms/image/C4D03AQGU-Ebe662_jA/profile-displayphoto-shrink_800_800/0/1572382388114?e=1683158400&v=beta&t=VikM8V4llHrF8MbKthOaj9vUVqwBakQ3MMIMEOE_md4",
                "IsMain": true
            }
        ]
    }
]